AOS.init({offset:400,delay:0,duration:1000});

let m = prompt("Доброго дня , Щоб продовжити розмову натисніть 1 ; Щоб закінчити натисніть 2 ");
if(m  == "1"){
    // alert("Привіт Іван"); 
    let m2 = prompt("Вам сподобалась ця робота?  Напишіть ; 1 - Так 2 - Ні");
    if(m2 == "1"){
        let m3 = prompt("Дякую , а ви нам покажете щось нове на наступному уроці в суботу?  ; 1 - Так 2 - Ні");
    if(m3 == "1"){
        let m4 = prompt("Це буде цікава тема ; 1 - Так 2 - Ні");
    if(m4 == "1"){
        let m5 = prompt("Ну гаразд , до суботи ; 1 - До суботи 2 - Не хочу проводити вам урок");
    if(m5 == "1"){alert(": ) ")}else{alert(":(  ")}}else{alert(":(  ")}}else{alert(":(  ")}}else{alert(":(  ")}



}else{
    alert("Розмова Завершена");
}